<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"9113c58cd75633cd6f105267e73f19306322e187c52a4cac00f2faf69c973e0f","plan_job_ref":"Job Apply terraform on merge to main #3 at https://github.com/securing-the-speed/github-configuration/actions/runs/10071183060","plan_out_hash":"fe09148cb7a00a1b3d0b81ab67942e02132780dcaf89bf92192622a98eb4ab5f","plan_hash":"5e387698c96d97ed971dd7898cbfc996614d5038f756ffdbf800ed39577ff9f6","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # github_organization_settings.securing_the_speed will be updated in-place
!~  resource "github_organization_settings" "securing_the_speed" {
        id                                                           = "176345980"
!~      members_can_create_internal_repositories                     = false -> true
        name                                                         = "Andrew Krug"
#        (24 unchanged attributes hidden)
    }

  # github_repository.serverless-listener will be created
+   resource "github_repository" "serverless-listener" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       archived                    = false
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = false
+       description                 = "A webhook listener example for serverless. :)"
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "serverless-security-listener"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = (known after apply)
+       visibility                  = "public"
+       web_commit_signoff_required = false

+       security_and_analysis (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Apply terraform on merge to main #3](https://github.com/securing-the-speed/github-configuration/actions/runs/10071183060)